; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	thermograph2 - mode
	thermograph0 - mode
	thermograph3 - mode
	image1 - mode
	GroundStation7 - direction
	GroundStation5 - direction
	Star1 - direction
	GroundStation3 - direction
	Star9 - direction
	GroundStation4 - direction
	Star0 - direction
	GroundStation8 - direction
	Star6 - direction
	Star10 - direction
	Star2 - direction
	Star11 - direction
	Planet12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
	Star17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image1)
	(calibration_target instrument0 Star10)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star17)
	(supports instrument1 thermograph3)
	(supports instrument1 thermograph2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star9)
	(supports instrument2 image1)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 thermograph3)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 thermograph2)
	(supports instrument4 image1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star11)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet15)
	(supports instrument5 thermograph3)
	(supports instrument5 thermograph0)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 Star1)
	(supports instrument6 image1)
	(supports instrument6 thermograph3)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 Star0)
	(calibration_target instrument7 GroundStation4)
	(calibration_target instrument7 Star9)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star17)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 Star0)
	(calibration_target instrument8 Star2)
	(calibration_target instrument8 GroundStation8)
	(supports instrument9 thermograph0)
	(supports instrument9 thermograph2)
	(supports instrument9 image1)
	(calibration_target instrument9 Star6)
	(calibration_target instrument9 GroundStation8)
	(supports instrument10 thermograph3)
	(calibration_target instrument10 Star11)
	(calibration_target instrument10 Star2)
	(calibration_target instrument10 Star10)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
)
(:goal (and
	(pointing satellite0 Planet13)
	(pointing satellite3 Star16)
	(have_image Planet12 thermograph0)
	(have_image Planet13 thermograph3)
	(have_image Planet14 image1)
	(have_image Planet15 thermograph3)
	(have_image Star16 thermograph0)
	(have_image Star17 thermograph0)
	(have_image Planet18 image1)
))

)

; plan
1. (turn_to satellite3 star16 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 star16)
   goals met: 1 of 9
2. (turn_to satellite2 groundstation8 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 groundstation8)
   goals met: 1 of 9
3. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 9
4. (calibrate satellite2 instrument5 groundstation8)
   added: (calibrated instrument5)
   goals met: 1 of 9
5. (turn_to satellite2 planet14 groundstation8)
   deleted: (pointing satellite2 groundstation8)
   added: (pointing satellite2 planet14)
   goals met: 1 of 9
6. (take_image satellite2 planet14 instrument5 image1)
   added: (have_image planet14 image1)
   goals met: 2 of 9
7. (turn_to satellite2 planet13 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 planet13)
   goals met: 2 of 9
8. (take_image satellite2 planet13 instrument5 thermograph3)
   added: (have_image planet13 thermograph3)
   goals met: 3 of 9
9. (turn_to satellite2 planet12 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 planet12)
   goals met: 3 of 9
10. (turn_to satellite0 planet13 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 planet13)
   goals met: 4 of 9
11. (take_image satellite2 planet12 instrument5 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 5 of 9
12. (turn_to satellite2 planet15 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet15)
   goals met: 5 of 9
13. (take_image satellite2 planet15 instrument5 thermograph3)
   added: (have_image planet15 thermograph3)
   goals met: 6 of 9
14. (turn_to satellite2 planet18 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 planet18)
   goals met: 6 of 9
15. (take_image satellite2 planet18 instrument5 image1)
   added: (have_image planet18 image1)
   goals met: 7 of 9
16. (turn_to satellite2 star16 planet18)
   deleted: (pointing satellite2 planet18)
   added: (pointing satellite2 star16)
   goals met: 7 of 9
17. (take_image satellite2 star16 instrument5 thermograph0)
   added: (have_image star16 thermograph0)
   goals met: 8 of 9
18. (turn_to satellite2 star17 star16)
   deleted: (pointing satellite2 star16)
   added: (pointing satellite2 star17)
   goals met: 8 of 9
19. (take_image satellite2 star17 instrument5 thermograph0)
   added: (have_image star17 thermograph0)
   goals met: 9 of 9
